module Inventory exposing (generate)

import Item exposing (Item, Kind(..))


generate : Result String (List Item)
generate =
    Ok
        (List.concat [ scrolls, herbs, rings, wands, vases ])


rings : List Item
rings =
    let
        gen name buyPrice sellPrice =
            Item.new Ring name buyPrice sellPrice
    in
    [ gen "とうぞくの指輪" 15000 2500
    , gen "ワナぬけの指輪" 15000 7500
    , gen "はね返しの指輪" 20000 8000
    , gen "うけながしの指輪" 20000 10000
    , gen "命の指輪" 20000 10000
    , gen "インパスの指輪" 25000 12500
    , gen "石像よけの指輪" 25000 12500
    , gen "技封じの指輪" 25000 12500
    , gen "母の形見" 2000 1000
    , gen "メタルリング" 2000 1000
    , gen "混乱よけの指輪" 3000 1500
    , gen "しあわせの指輪" 4000 2000
    , gen "たれ流しの指輪" 4000 2000
    , gen "傷みよけの指輪" 5000 2500
    , gen "眠らずの指輪" 5000 2500
    , gen "ハラ守りの指輪" 5000 2500
    , gen "毒けしの指輪" 5000 2500
    , gen "ちからの指輪" 5000 2500
    , gen "通過の指輪" 5000 2500
    , gen "爆発の指輪" 5000 2500
    , gen "まがりの指輪" 5000 2500
    , gen "ワナあての指輪" 5000 2500
    , gen "ハラモチの指輪" 5000 2500
    , gen "へた投げの指輪" 5000 2500
    , gen "ミニデーモンの指輪" 5000 2500
    , gen "呪いよけの指輪" 5000 2500
    , gen "ふしぎ投げの指輪" 5000 2500
    , gen "ルーラの指輪" 7500 1500
    , gen "遠投の指輪" 7500 3000
    , gen "きれいな指輪" 8000 3000
    , gen "透視の指輪" 10000 5000
    , gen "回復の指輪" 10000 5000
    , gen "値切りの指輪" 10000 5000
    , gen "ザメハの指輪" 10000 5000
    , gen "シャドーの指輪" 10000 5000
    , gen "ハラペコの指輪" 10000 5000
    , gen "人形よけの指輪" 10000 5000
    , gen "ドラゴンの指輪" 10000 5000
    , gen "しにがみの指輪" 10000 5000
    , gen "投げ名人の指輪" 10000 5000
    , gen "ハラヘラズの指輪" 15000 1000
    , gen "会心の指輪" 15000 7500
    , gen "まもりの指輪" 20000 10000
    , gen "ふつうの指輪" 5000 2500
    , gen "紙一重の指輪" 10000 5000
    , gen "ファイターリング" 10000 5000
    , gen "痛恨の指輪" 15000 7500
    , gen "魔封じの指輪" 25000 12500
    , gen "見切りの指輪" 25000 12500
    , gen "黄金の指輪" 25000 12500
    ]


vases : List Item
vases =
    let
        gen name buyPrice sellPrice =
            Item.new Vase name buyPrice sellPrice
    in
    [ gen "とじこめの壺" 1500 750
    , gen "父のとっくり" 1500 750
    , gen "魔法の壺" 10000 2000
    , gen "ふつうの壺" 1000 500
    , gen "回復の壺" 1000 500
    , gen "水がめ" 1000 500
    , gen "大砲の壺" 1000 500
    , gen "倉庫の壺" 1000 500
    , gen "われにくい壺" 1500 750
    , gen "保存の壺" 1500 750
    , gen "インパスの壺" 2000 1200
    , gen "呪いの壺" 3000 1500
    , gen "祝福の壺" 3000 1500
    , gen "ワープの壺" 3000 1500
    , gen "合成の壺" 3000 1500
    , gen "まものの壺" 3000 1500
    , gen "火薬壺" 4000 2000
    , gen "すいこみの壺" 5000 1500
    , gen "へんげの壺" 5000 1500
    , gen "草の神の壺" 5000 2000
    , gen "黄金の壺" 10000 2000
    , gen "うそつきの壺" 10000 2000
    ]


wands : List Item
wands =
    let
        gen name buyPrice sellPrice =
            Item.new Wand name buyPrice sellPrice
    in
    [ gen "トンネルの杖" 500 200
    , gen "ホイミの杖" 500 250
    , gen "火柱の杖" 800 400
    , gen "とびつきの杖" 800 400
    , gen "レミーラの杖" 800 400
    , gen "バシルーラの杖" 800 400
    , gen "いかずちの杖" 800 400
    , gen "場所替えの杖" 800 400
    , gen "氷柱の杖" 800 400
    , gen "砂柱の杖" 800 400
    , gen "風の杖" 800 400
    , gen "木彫りのバット" 1000 500
    , gen "一時しのぎの杖" 1000 500
    , gen "もろはの杖" 1000 500
    , gen "へんげの杖" 1000 500
    , gen "メダパニの杖" 1200 250
    , gen "ラリホーの杖" 1200 400
    , gen "イカリの杖" 1200 600
    , gen "かなしばりの杖" 1200 600
    , gen "痛みわけの杖" 1200 600
    , gen "ひきよせの杖" 1200 600
    , gen "ルカニの杖" 1200 600
    , gen "ボミオスの杖" 1200 600
    , gen "ふきとばしの杖" 1200 600
    , gen "封印の杖" 1500 500
    , gen "クオーターの杖" 2000 1000
    , gen "おびえの杖" 2000 1000
    , gen "大損の杖" 2000 1000
    , gen "モノカの杖" 2000 1000
    , gen "身代わりの杖" 2500 1000
    , gen "分裂の杖" 2500 1200
    , gen "ピオリムの杖" 2500 1200
    , gen "レムオルの杖" 3000 1200
    , gen "転ばぬ先の杖" 3000 1400
    , gen "きとうしの杖" 3000 1500
    , gen "バーサーカーの杖" 3000 1500
    , gen "ミミックの杖" 3000 1500
    , gen "万能の杖" 3000 1500
    , gen "ようじゅつしの杖" 4000 2000
    , gen "マヌーサの杖" 5000 2500
    , gen "草なげの杖" 5000 2500
    , gen "草うけの杖" 5000 2500
    , gen "ドルイドの杖" 6000 3000
    , gen "げんじゅつしの杖" 8000 4000
    , gen "丸得の杖" 10000 1
    , gen "ザキの杖" 10000 2500
    , gen "黄金の杖" 10000 2500
    , gen "ゴッドスパークの杖" 10000 5000
    ]


herbs : List Item
herbs =
    let
        gen name buyPrice sellPrice =
            Item.new Herb name buyPrice sellPrice
    in
    [ gen "パルプンテの巻物" 0 0
    , gen "でたらめ草" 100 50
    , gen "踊り草" 100 50
    , gen "かなしばりのたね" 100 50
    , gen "目覚まし草" 100 50
    , gen "胃下垂のたね" 100 50
    , gen "火炎草" 100 50
    , gen "ルーラ草" 100 50
    , gen "雑草" 100 50
    , gen "草ぶえ" 100 50
    , gen "毒草" 150 75
    , gen "バーサーカーのたね" 150 75
    , gen "まどわし草" 150 75
    , gen "めつぶし草" 200 100
    , gen "メダパニ草" 200 100
    , gen "鉄化のたね" 200 100
    , gen "ラリホー草" 200 100
    , gen "毒けし草" 300 1
    , gen "めぐすり草" 300 150
    , gen "ふこうのたね" 300 150
    , gen "すばやさのたね" 350 170
    , gen "胃縮小のたね" 600 300
    , gen "胃拡張のたね" 600 300
    , gen "しんぴの草" 1000 500
    , gen "世界樹の葉" 1500 750
    , gen "黄金の草" 2000 100
    , gen "薬草" 2000 1000
    , gen "命の草" 4000 2000
    , gen "ちからのたね" 5000 2500
    , gen "しあわせのたね" 5000 2500
    , gen "弟切草" 5000 2500
    ]


scrolls : List Item
scrolls =
    let
        gen name buyPrice sellPrice =
            Item.new Scroll name buyPrice sellPrice
    in
    [ gen "リレミトの巻物" 100 50
    , gen "大部屋の巻物" 300 150
    , gen "聖城の巻物" 400 200
    , gen "氷結の巻物" 400 200
    , gen "炎上の巻物" 400 200
    , gen "ワナ作動の巻物" 400 200
    , gen "水がれの巻物" 400 200
    , gen "ダイバクハツの巻物" 400 200
    , gen "砂柱の巻物" 400 200
    , gen "ワナけしの巻物" 500 250
    , gen "うしろむきの巻物" 500 250
    , gen "インパスの巻物" 500 250
    , gen "ルカナンの巻物" 650 300
    , gen "すごろく" 650 300
    , gen "メッキの巻物" 650 300
    , gen "パンの巻物" 650 300
    , gen "たからの地図" 650 300
    , gen "レミーラの巻物" 650 300
    , gen "かなしばりの巻物" 650 300
    , gen "らくがき帳" 650 300
    , gen "銀のたてごとの巻物" 650 300
    , gen "地獄耳の巻物" 650 300
    , gen "トラマナの巻物" 650 300
    , gen "まものしばりの巻物" 650 300
    , gen "千里眼の巻物" 650 300
    , gen "すてみの巻物" 650 300
    , gen "大風の巻物" 650 300
    , gen "はりつけの巻物" 650 300
    , gen "メダパニの巻物" 650 300
    , gen "パワーアップの巻物" 650 300
    , gen "バクスイの巻物" 650 300
    , gen "ザオラルの巻物" 650 300
    , gen "ひきよせの巻物" 650 300
    , gen "壺強化の巻物" 700 350
    , gen "中部屋の巻物" 700 350
    , gen "くちなしの巻物" 1000 500
    , gen "イオの巻物" 1000 500
    , gen "変身の巻物" 1000 500
    , gen "モンスターの巻物" 1000 500
    , gen "ワナの巻物" 1000 500
    , gen "時限爆弾の巻物" 1000 500
    , gen "スカラの巻物" 1500 750
    , gen "バイキルトの巻物" 1500 750
    , gen "ふはつの巻物" 2000 1000
    , gen "聖域の巻物" 2500 1250
    , gen "ベホマラーの巻物" 2500 1250
    , gen "拾えずの巻物" 2500 1250
    , gen "シャナクの巻物" 3000 500
    , gen "白紙の巻物" 5000 2500
    , gen "祈りの巻物" 5000 2500
    , gen "まものいそぎの巻物" 5000 2500
    , gen "ニフラムの巻物" 20000 1
    , gen "チキンの巻物" 20000 1
    , gen "黄金の紙切れ" 20000 1000
    ]
